export const REFUND = [
  {
    list: [
      {
        noNum: true,
        text:
          'При оплате банковской платежной карточкой возврат наличными денежными средствами не допускается. Расчеты с потребителем при возврате уплаченной за товар денежной суммы, при расторжении договора о выполнении работы (оказании услуги) осуществляются в той же форме, в которой производилась оплата товара, работы (услуги), если иное не предусмотрено соглашением сторон. Порядок возврата регулируется правилами международных платежных систем.',
      },
      {
        noNum: true,
        text:
          'Процедура возврата товара регламентируется Законом Республики Беларусь от 9 января 2002 г. N90-З «О защите прав потребителей»:',
        dashList: [
          'Потребитель вправе отказаться от товара в течение 14(четырнадцати) дней с момента передачи ему товара;',
          'Потребитель вправе в одностороннем порядке отказаться от исполнения договора о выполнении работы (оказании услуги) при условии оплаты исполнителю фактически понесенных им расходов, если иное не предусмотрено законодательством;',
          'Требование потребителя об обмене либо возврате качественного товара подлежит удовлетворению, если товар не был в употреблении, сохранены его потребительские свойства и имеются доказательства приобретения его у данного продавца;',
          'Перечень непродовольственных товаров надлежащего качества, не подлежащих обмену и возврату, утверждается Правительством Республики Беларусь.',
        ],
      },
      {
        noNum: true,
        text:
          'Для возврата денежных средств на банковскую платежную карточку необходимо заполнить «Заявление о возврате денежных средств» и отправить его по электронному адресу letiqueby@ya.ru',
      },
      {
        noNum: true,
        text:
          'Возврат денежных средств будет осуществлен на банковскую платежную карточку в течение 7 (семи) календарных дней со дня получения «Заявление о возврате денежных средств» Компанией. Сумма возврата будет равняться сумме покупки.',
      },
      {
        noNum: true,
        text:
          'Для возврата денежных средств по операциям проведенными с ошибками необходимо обратиться с письменным заявлением и приложением чеков/квитанций, подтверждающих ошибочное списание. Данное заявление необходимо направить по электронному адресу letiqueby@ya.ru',
      },
    ],
  },
];
