export const RECEIVING_PURCHASE = [
  {
    list: [
      {
        noNum: true,
        text: 'Все почтовые отправления выдаются на основании:',
        dashList: [
          'документа, удостоверяющего личность;',
          'водительского удостоверения;',
          'военного билета военнослужащего срочной службы;',
          'справки об обращении с ходатайством о предоставлении статуса беженца, дополнительной защиты или убежища в Республике Беларусь – для получения заказных отправлений письменной корреспонденции;',
          'свидетельства о регистрации ходатайства о предоставлении статуса беженца, дополнительной защиты или убежища в Республике Беларусь;',
          'свидетельства о предоставлении дополнительной защиты в Республике Беларусь (в случае отсутствия документа, удостоверяющего личность).',
        ],
      },
      {
        noNum: true,
        text:
          'Адресат может уполномочить другое лицо на получение почтового отправления, выдав ему доверенность, удостоверенную в установленном законодательством Республики Беларусь порядке. Разовые доверенности на получение почтовых отправлений либо копии специальных или общих доверенностей остаются у исполнителя. Как только почтовое отправление поступит на отделение почтовой связи, вам придёт смс с информацией о поступлении. После формирования рейса на номер получателя будет отправлено смс сообщение с номером экспедитора.',
      },
    ],
  },
];
