export const USER_AGREEMENT = [
  {
    title: 'Общие положения',
    list: [
      {
        text:
          'Настоящий договор является официальным предложением Продавца неопределенному кругу лиц к заключению договора розничной купли-продажи товара (далее по тексту - договор РКП) на условиях, указанных на сайте интернет-магазина и определенных в настоящей оферте.',
      },
      {
        text:
          'Публичный договор не требует оформления на бумаге и его последующего подписания сторонами, обладает юридической силой в силу совершения сторонами определенных действий, указывающих на их волеизъявление вступить в договорные отношения.',
      },
      {
        text:
          'Условия продажи товара и договора РКП, заключаемого Продавцом и Покупателем, определяются Продавцом. Продавец вправе в одностороннем порядке менять условия оферты, в том числе способы и сроки оплаты и доставки товара, а также цены на товары. Все изменения доводятся до сведения Покупателя путем их размещения на сайте интернет-магазина. Изменения не касаются принятых Продавцом к исполнению заказов.',
      },
      {
        text:
          'Покупатель обязуется до момента отправки заказа Продавцу и заключения договора РКП ознакомиться условиями настоящего договора, информацией о товаре в интернет-магазине и ценами на него.',
      },
      {
        text:
          'При совместном упоминании Покупателя и Продавца по тексту настоящего договора последние именуются Стороны, а каждый по отдельности Сторона.',
      },
      {
        text:
          'Каждая Сторона гарантирует другой Стороне, что обладает соответствующим правом и достаточным объемом дееспособности, а равно всеми иными правами и полномочиями, необходимыми для заключения и исполнения настоящего договора.',
      },
      {
        text:
          'Осуществляя Заказ Товара через Интернет-магазин, Покупатель принимает и соглашается со всеми условиями, изложенными в настоящем договоре, и с информацией, размещенной на Сайте в момент принятия Продавцом Заказа.',
      },
      {
        text:
          'К отношениям между Сторонами по настоящему договору применяются требования Законов Республики Беларусь «О торговле», «О защите прав потребителей» (далее – Закон) и иные нормативные и правовые акты Республики Беларусь, регулирующие вопросы розничной купли-продажи.',
      },
      {
        text:
          'Продавец оставляет за собой право вносить изменения в настоящий договор и в информацию на Сайте, в связи с чем Покупатель обязуется на момент обращения к Продавцу c Заказом на Товар учитывать возможные изменения.',
      },
      {
        text:
          'Публикация информации, очевидно не соответствующей товару, в том числе цены, фото и описания товара, признается технической ошибкой.',
      },
    ],
  },
  {
    title: 'Оформление и сроки выполнения заказа',
    list: [
      {
        noNum: true,
        text:
          'Режим работы интернет-магазина: с 10:00 до 20:00, Выходные - сб, вс, праздничные дни.',
      },
      {
        text:
          'Заказ Покупателя может быть оформлен по телефону и/или через Сайт интернет-магазина.',
        subList: [
          'При оформлении Заказа по телефону Покупатель предоставляет Продавцу следующую необходимую информацию для оформления Заказа: желаемый товар и количество, адрес доставки товара, контактный телефон, желаемое время получения заказа.',
          'При оформлении Заказа через Сайт Покупатель заполняет электронную форму Заказа на Товар и отправляет сформированный Заказ Продавцу посредством сети Интернет.',
        ],
      },
      {
        text:
          'Информация в Заказе, полученном Продавцом, согласовывается с Покупателем либо Получателем по контактному телефону или электронной почте с целью уточнения, в том числе, конкретной даты и времени доставки Товара. Конкретная дата и время доставки зависят от выбранного товара, места доставки и времени, необходимого Продавцу на обработку Заказа.',
      },
      {
        text:
          'При оформлении Заказа через Сайт Покупатель получает на указанный им электронный адрес уведомительное электронное Письмо, подтверждающее факт оформления покупателем формы Заказа на сайте Продавца. Данное уведомительное письмо является подтверждением факта принятия Заказа Продавцом.',
      },
      {
        text:
          'В случае обнаружения, что на складе Продавца отсутствует необходимый Товар или необходимое его количество, Продавец информирует об этом Покупателя по контактному телефону, отраженному в Заказе. Покупатель вправе согласиться принять Товар в количестве, имеющемся в наличии у Продавца, либо отказаться (аннулировать) от Заказа.',
      },
      {
        text:
          'В случае возникновения у Покупателя вопросов, касающихся описания, свойств и характеристик Товара, перед оформлением Заказа Покупатель должен обратиться к Продавцу по телефонам или с помощью средств онлайн-консультации, указанным на Сайте Интернет-магазина.',
      },
      {
        text:
          'Продавец вправе отказать клиенту в подтверждении или выполнении заказа в случае обнаружения в нем технической ошибки, связанной с работой программного обеспечения на стороне Продавца, либо обеспечивающих его функционирование сторонних сервисов, в том числе явившейся следствием неправомерных действий со стороны третьих лиц.',
      },
    ],
  },
  {
    title: 'Доставка товара',
    list: [
      {
        text:
          'При Заказе Товара Покупателем на условиях доставки Продавец приложит все усилия, чтобы соблюсти сроки доставки Товара, указанные на Сайте или согласованные с Покупателем после оформления заказа, при этом не исключая причин, которые могут возникнуть и повлиять на сроки доставки в виде непредвиденных событий и обстоятельств, произошедших не по вине Продавца.',
      },
      {
        text:
          'Риск случайной гибели или случайного повреждения Товара переходит к Покупателю или Получателю в момент передачи Товара.',
      },
      {
        text:
          'В момент доставки Товара лицо, осуществляющее доставку, демонстрирует Покупателю и/или Получателю внешний вид и комплектность Товара. Если товар имеет внешние недостатки, покупатель имеет право отказаться от товара.',
      },
      {
        text:
          'Покупатель или Получатель в момент получения Товара получает пакет документов на Товар: кассовый чек, при условии, что оплата производится в момент получения заказа.',
      },
      {
        text:
          'Проверка Товара должна производиться с сохранением товарного вида.',
      },
      {
        text:
          'Вернуть или обменять товар надлежащего качества можно по адресу: 220045 г. Минск, ул. Чюрлениса 14, пом. 201. При этом продавец возвращает сумму, уплаченную покупателем, за исключением расходов продавца на доставку не позднее чем через 7 дней с момента предъявления соответствующего требования.',
      },
      {
        text:
          'Продавец вправе произвести ограничения одновременно доставляемого Покупателю товара.',
      },
    ],
  },
  {
    title: 'Оплата товара',
    list: [
      {
        text:
          'Цена Товара указывается рядом с определенным наименованием товара на Сайте Интернет-магазина на странице товара в белорусских рублях и включает в себя налог на добавленную стоимость.',
      },
      {
        text:
          'Оплата товара Покупателем или Получателем производится в белорусских рублях в форме и способами, указанными Продавцом в разделе «оплата и доставка» на Сайте интернет-магазина.',
      },
      {
        text:
          'Покупатель или Получатель товара возмещает Продавцу расходы, связанные с доставкой товара, по расценкам указанными Продавцом в разделе «оплата и доставка» на Сайте интернет-магазина.',
      },
      {
        text:
          'Продавец вправе предоставлять Покупателю или Получателю скидки на Товары и устанавливать программу бонусов. Виды скидок указываются на Сайте Интернет-магазина в публичном доступе и могут быть изменены Продавцом в одностороннем порядке.',
      },
    ],
  },
  {
    title: 'Гарантии и ответственность',
    list: [
      {
        text:
          'Продавец не несет ответственности за ущерб, причиненный Покупателем или Получателем вследствие ненадлежащего использования последними Товара, приобретенного в Интернет-магазине Продавца.',
      },
      {
        text:
          'Продавец не несет ответственности за содержание и функционирование других сайтов Интернета.',
      },
      {
        text:
          'Продавец вправе переуступать либо каким-либо иным способом передавать свои права иобязанности, вытекающие из его отношений с Покупателем или Покупателем, третьим лицам.',
      },
      {
        text:
          'Продавец не несет ответственности за последствия, связанные с действиями Покупателя или Получателя в случае использования Товара, приобретенного у Продавца, в предпринимательских целях.',
      },
      {
        text:
          'Продавец не отвечает за убытки Покупателя или Получателя, возникшие в результате:',
        dashList: [
          'предоставления не достоверной информации при согласовании Заказа, в т.ч. неправильного указания идентификационных сведений;',
          'неправомерных действий третьих лиц.',
        ],
      },
      {
        text:
          'Покупатель или Получатель несет полную ответственность за достоверность идентификационных сведений, указанных им при Заказе Товара в Интернет-магазине.',
      },
      {
        text:
          'Стороны освобождаются от ответственности за полное или частичное неисполнение своих обязательств, если такое неисполнение явилось следствием действия обстоятельств непреодолимой силы, возникших после вступления в силу настоящего договора и/или в результате событий чрезвычайного характера, которые Стороны не могли предвидеть и предотвратить разумными мерами.',
      },
      {
        text:
          'В иных случаях, не предусмотренных пунктом 5.7 настоящего договора, за неисполнение или ненадлежащее исполнение своих обязательств, Стороны несут ответственность в соответствии с действующим законодательством Республики Беларусь.',
      },
      {
        text:
          'В случае необоснованного отказа от приобретения товара, Покупатель обязан возместить расходы Продавца, связанные с доставкой товара Покупателю.',
      },
    ],
  },
  {
    title: 'Прочие условия',
    list: [
      {
        text:
          'К отношениям между Покупателем и Продавцом применяется право Республики Беларусь.',
      },
      {
        text:
          'В случае возникновения вопросов и претензий со стороны Покупателя или Получателя, он должен обратиться к Продавцу по телефону или через иные формы связи (пример - e-mail).',
      },
      {
        text:
          'Все возникающее споры Стороны будут стараться решить путем переговоров. При недостижении обоюдовыгодного соглашения, спор между Сторонами будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Республики Беларусь.',
      },
      {
        text:
          'Признание судом недействительности какого-либо положения настоящего договора не влечет за собой недействительность его остальных положений.',
      },
      {
        text:
          'Продавец имеет право использовать электронный адрес и телефонные номера Покупателя для рассылки информационных сообщений.',
      },
      {
        text:
          'Продавец вправе не подтвердить либо аннулировать заказ и уведомить об этом Покупателя, отказать в оплате и/или продаже Товара по указанной цене, если она явилась следствием технической ошибки или неправомерных действий со стороны третьих лиц. Стоимость товара может быть следствием указанных обстоятельств, если отличается от медианы стоимости данной модели/модификации товара по рынку в данный момент времени более чем на 20%. В таком случае Продавец вправе отказать в оплате и/или продаже данного товара по указанной цене.',
      },
      {
        text:
          'В целях сохранения информации о заказах Покупателя, а также проведения внутренних маркетинговых исследований Покупатель разрешает Продавцу собирать, обрабатывать и хранить информацию о своих персональных данных (в том числе фамилию, имя, отчество, пол, биометрические персональные данные, адрес; телефоны, адрес электронной почты).',
      },
      {
        text:
          'Продавец обязуется обеспечивать конфиденциальность полученной от Покупателя информации в отношении его персональных данных, данных о средствах платежа (пластиковых картах) и в отношении заказов Покупателя в порядке, установленном действующим законодательством Республики Беларусь.',
      },
      {
        text:
          'Оставляя персональные данные, Покупатель подтверждает тем самым свое согласие на получение электронных писем и СМС - сообщений, содержащих информацию о новинках, акциях, специальных предложениях, и т.д. Покупатель вправе отказаться от получения электронных писем и СМС - сообщений, уведомив об этом Продавца.',
      },
      {
        text:
          'Оставляя персональные данные, Покупатель подтверждает тем самым свое согласие на получение электронных писем и СМС - сообщений, содержащих информацию о новинках, акциях, специальных предложениях, и т.д. Покупатель вправе отказаться от получения электронных писем и СМС - сообщений, уведомив об этом Продавца.',
      },
    ],
  },
  {
    title: 'Реквизиты Продавца',
    list: [
      {
        noNum: true,
        text:
          'ООО «ЛетикБел»<br>220045 г. Минск ул. Чюрлениса 14 пом. 201<br>УНП 193394416<br>Банк: ЗАО "АЛЬФА-БАНК"<br>Ул. Сурганова, 43-47, 220013 Минск, Республика Беларусь<br>СВИФТ - ALFABY2X<br>р/с BY33 ALFA 3012 2621 8200 1027 0000  (BYN)',
      },
    ],
  },
];
