export const DATA_POLICY = [
  {
    list: [
      {
        noNum: true,
        text:
          'Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности) действует в отношении всей информации, которую данный сайт, на котором размещен текст этой Политики конфиденциальности, может получить о Пользователе, а также любых программ и продуктов, размещенных на нем.',
      },
    ],
  },
  {
    title: 'Определение терминов',
    list: [
      {
        text:
          'В настоящей Политике конфиденциальности используются следующие термины:',
        subList: [
          '«Администрация сайта» – уполномоченные сотрудники на управления сайтом, действующие от его имени, которые организуют и (или) осуществляет обработку персональных данных, а также определяет цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными;',
          '«Персональные данные» - любая информация, относящаяся к прямо или косвенно определенному или определяемому физическому лицу (субъекту персональных данных);',
          '«Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных;',
          '«Конфиденциальность персональных данных» - обязательное для соблюдения Администрацией сайта требование не допускать их умышленного распространения без согласия субъекта персональных данных или наличия иного законного основания;',
          '«Пользователь сайта (далее Пользователь)» – лицо, имеющее доступ к сайту, посредством сети Интернет и использующее данный сайт для своих целей;',
          '«Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта;',
          '«IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.',
        ],
      },
    ],
  },
  {
    title: 'Общие положения',
    list: [
      {
        text:
          'Использование Пользователем сайта означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.',
      },
      {
        text:
          'В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта.',
      },
      {
        text:
          'Настоящая Политика конфиденциальности применяется только к данному сайту. Администрация сайта не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на данном сайте.',
      },
      {
        text:
          'Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта.',
      },
    ],
  },
  {
    title: 'Предмет политики конфиденциальности',
    list: [
      {
        text:
          'Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта по умышленному неразглашению персональных данных, которые Пользователь предоставляет по разнообразным запросам Администрации сайта (например, при регистрации на сайте, оформлении заказа, подписки на уведомления и т.п).',
      },
      {
        text:
          'Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения специальных форм на Сайте и обычно включают в себя следующую информацию:',
        dashList: [
          'фамилию, имя, отчество Пользователя;',
          'контактный телефон Пользователя;',
          'адрес электронной почты (e-mail);',
          'место жительство Пользователя и другие данные.',
        ],
      },
      {
        text:
          'Администрация сайта также принимает усилия по защите Персональных данных, которые автоматически передаются в процессе посещения страниц сайта: IP адрес; информация из cookies; информация о браузере (или иной программе, которая осуществляет доступ к сайту); время доступа; посещенные адреса страниц; реферер (адрес предыдущей страницы) и т.п.',
        subList: [
          'Отключение cookies может повлечь невозможность доступа к сайту.',
          'Сайт осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля корректности проводимых операций.',
        ],
      },
      {
        text:
          'Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) не подлежит умышленному разглашению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.',
      },
    ],
  },
  {
    title: 'Цели сбора персональной информации пользователя',
    list: [
      {
        text:
          'Персональные данные Пользователя Администрация сайта может использовать в целях:',
        subList: [
          'Идентификации Пользователя, зарегистрированного на сайте, для оформления заказа и (или) заключения Договора;',
          'Предоставления Пользователю доступа к персонализированным ресурсам сайта;',
          'Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования сайта, оказания услуг, обработка запросов и заявок от Пользователя;',
          'Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества;',
          'Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем;',
          'Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи;',
          'Уведомления Пользователя сайта о состоянии Заказа;',
          'Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на получение кредитной линии Пользователем;',
          'Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем связанных с использованием сайта;',
          'Предоставления Пользователю с его согласия, обновлений продукции, специальных предложений, информации о ценах, новостной рассылки и иных сведений от имени сайта или от имени партнеров сайта;',
          'Осуществления рекламной деятельности с согласия Пользователя;',
          'Предоставления доступа Пользователю на сторонние сайты или сервисы партнеров данного сайта с целью получения их предложений, обновлений или услуг.',
        ],
      },
    ],
  },
  {
    title: 'Способы и сроки обработки персональной информации',
    list: [
      {
        text:
          'Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.',
      },
      {
        text:
          'Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заявок Пользователя, оформленных на сайте, в рамках Договора публичной оферты.',
      },
      {
        text:
          'Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти только по основаниям и в порядке, установленным действующим законодательством.',
      },
    ],
  },
  {
    title: 'Обязательства сторон',
    list: [
      {
        text: 'Пользователь обязуется:',
        subList: [
          'Предоставить корректную и правдивую информацию о персональных данных, необходимую для пользования сайтом;',
          'Обновить или дополнить предоставленную информацию о персональных данных в случае изменения данной информации;',
          'Принимать меры для защиты доступа к своим конфиденциальным данным, хранящимся на сайте.',
        ],
      },
      {
        text: 'Администрация сайта обязуется:',
        subList: [
          'Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности;',
          'Не разглашать персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности;',
          'Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.',
        ],
      },
    ],
  },
  {
    title: 'Ответственность сторон',
    list: [
      {
        text:
          'Администрация сайта несёт ответственность за умышленное разглашение Персональныхданных Пользователя в соответствии с действующим законодательством, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.',
      },
      {
        text:
          'В случае утраты или разглашения Персональных данных Администрация сайта не несёт ответственность, если данная конфиденциальная информация:',
        subList: [
          'Стала публичным достоянием до её утраты или разглашения;',
          'Была получена от третьей стороны до момента её получения Администрацией сайта;',
          'Была получена третьими лицами путем несанкционированного доступа к файлам сайта;',
          'Была разглашена с согласия Пользователя.',
        ],
      },
      {
        text:
          'Пользователь несет ответственность за правомерность, корректность и правдивость предоставленной Персональных данных в соответствии с действующим законодательством.',
      },
    ],
  },
  {
    title: 'Разрешение споров',
    list: [
      {
        text:
          'До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).',
      },
      {
        text:
          'Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.',
      },
      {
        text:
          'При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством.',
      },
      {
        text:
          'К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство.',
      },
    ],
  },
  {
    title: 'Дополнительные условия',
    list: [
      {
        text:
          'Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.',
      },
      {
        text:
          'Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если иное не предусмотрено новой редакцией Политики конфиденциальности.',
      },
    ],
  },
];
